shockTube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    U       (0 0 0);
    T    #calc "1./287";
    p       1;
}

zones
{
    lowPressure
    {
        type        box;

        box         (0 -1 -1) (1 1 1);

        values
        {
            T   #calc  "0.1/(0.125*287)";
            p       0.1;
        }
    }
}

// ************************************************************************* //
